const hizbs = [
  {
    "hizb": 1,
    "startSurahNumber": 1,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
    "endSurahNumber": 2,
    "endAyahNumber": 74
  },
  {
    "hizb": 2,
    "startSurahNumber": 2,
    "startAyahNumber": 75,
    "startAyahText": "۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌۭ مِّنْهُمْ يَسْمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
    "endSurahNumber": 2,
    "endAyahNumber": 141
  },
  {
    "hizb": 3,
    "startSurahNumber": 2,
    "startAyahNumber": 142,
    "startAyahText": "۞ سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمْ عَن قِبْلَتِهِمُ ٱلَّتِى كَانُوا۟ عَلَيْهَا ۚ قُل لِّلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ ۚ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "endSurahNumber": 2,
    "endAyahNumber": 202
  },
  {
    "hizb": 4,
    "startSurahNumber": 2,
    "startAyahNumber": 203,
    "startAyahText": "۞ وَٱذْكُرُوا۟ ٱللَّهَ فِىٓ أَيَّامٍۢ مَّعْدُودَٰتٍۢ ۚ فَمَن تَعَجَّلَ فِى يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ ۚ لِمَنِ ٱتَّقَىٰ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ",
    "endSurahNumber": 2,
    "endAyahNumber": 252
  },
  {
    "hizb": 5,
    "startSurahNumber": 2,
    "startAyahNumber": 253,
    "startAyahText": "۞ تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍۢ ۘ مِّنْهُم مَّن كَلَّمَ ٱللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَٰتٍۢ ۚ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ ۗ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ وَلَٰكِنِ ٱخْتَلَفُوا۟ فَمِنْهُم مَّنْ ءَامَنَ وَمِنْهُم مَّن كَفَرَ ۚ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُوا۟ وَلَٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
    "endSurahNumber": 3,
    "endAyahNumber": 14
  },
  {
    "hizb": 6,
    "startSurahNumber": 3,
    "startAyahNumber": 15,
    "startAyahText": "۞ قُلْ أَؤُنَبِّئُكُم بِخَيْرٍۢ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَا وَأَزْوَٰجٌۭ مُّطَهَّرَةٌۭ وَرِضْوَٰنٌۭ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
    "endSurahNumber": 3,
    "endAyahNumber": 92
  },
  {
    "hizb": 7,
    "startSurahNumber": 3,
    "startAyahNumber": 93,
    "startAyahText": "۞ كُلُّ ٱلطَّعَامِ كَانَ حِلًّۭا لِّبَنِىٓ إِسْرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسْرَٰٓءِيلُ عَلَىٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَىٰةُ ۗ قُلْ فَأْتُوا۟ بِٱلتَّوْرَىٰةِ فَٱتْلُوهَآ إِن كُنتُمْ صَٰدِقِينَ",
    "endSurahNumber": 3,
    "endAyahNumber": 170
  },
  {
    "hizb": 8,
    "startSurahNumber": 3,
    "startAyahNumber": 171,
    "startAyahText": "۞ يَسْتَبْشِرُونَ بِنِعْمَةٍۢ مِّنَ ٱللَّهِ وَفَضْلٍۢ وَأَنَّ ٱللَّهَ لَا يُضِيعُ أَجْرَ ٱلْمُؤْمِنِينَ",
    "endSurahNumber": 4,
    "endAyahNumber": 23
  },
  {
    "hizb": 9,
    "startSurahNumber": 4,
    "startAyahNumber": 24,
    "startAyahText": "۞ وَٱلْمُحْصَنَٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتْ أَيْمَٰنُكُمْ ۖ كِتَٰبَ ٱللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمْ أَن تَبْتَغُوا۟ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَٰفِحِينَ ۚ فَمَا ٱسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةًۭ ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ ٱلْفَرِيضَةِ ۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًۭا",
    "endSurahNumber": 4,
    "endAyahNumber": 87
  },
  {
    "hizb": 10,
    "startSurahNumber": 4,
    "startAyahNumber": 88,
    "startAyahText": "۞ فَمَا لَكُمْ فِى ٱلْمُنَٰفِقِينَ فِئَتَيْنِ وَٱللَّهُ أَرْكَسَهُم بِمَا كَسَبُوٓا۟ ۚ أَتُرِيدُونَ أَن تَهْدُوا۟ مَنْ أَضَلَّ ٱللَّهُ ۖ وَمَن يُضْلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلًۭا",
    "endSurahNumber": 4,
    "endAyahNumber": 147
  },
  {
    "hizb": 11,
    "startSurahNumber": 4,
    "startAyahNumber": 148,
    "startAyahText": "۞ لَّا يُحِبُّ ٱللَّهُ ٱلْجَهْرَ بِٱلسُّوٓءِ مِنَ ٱلْقَوْلِ إِلَّا مَن ظُلِمَ ۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا",
    "endSurahNumber": 5,
    "endAyahNumber": 26
  },
  {
    "hizb": 12,
    "startSurahNumber": 5,
    "startAyahNumber": 27,
    "startAyahText": "۞ وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱبْنَىْ ءَادَمَ بِٱلْحَقِّ إِذْ قَرَّبَا قُرْبَانًۭا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ ٱلْءَاخَرِ قَالَ لَأَقْتُلَنَّكَ ۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلْمُتَّقِينَ",
    "endSurahNumber": 5,
    "endAyahNumber": 81
  },
  {
    "hizb": 13,
    "startSurahNumber": 5,
    "startAyahNumber": 82,
    "startAyahText": "۞ لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةًۭ لِّلَّذِينَ ءَامَنُوا۟ ٱلْيَهُودَ وَٱلَّذِينَ أَشْرَكُوا۟ ۖ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةًۭ لِّلَّذِينَ ءَامَنُوا۟ ٱلَّذِينَ قَالُوٓا۟ إِنَّا نَصَٰرَىٰ ۚ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًۭا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ",
    "endSurahNumber": 6,
    "endAyahNumber": 35
  },
  {
    "hizb": 14,
    "startSurahNumber": 6,
    "startAyahNumber": 36,
    "startAyahText": "۞ إِنَّمَا يَسْتَجِيبُ ٱلَّذِينَ يَسْمَعُونَ ۘ وَٱلْمَوْتَىٰ يَبْعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ",
    "endSurahNumber": 6,
    "endAyahNumber": 110
  },
  {
    "hizb": 15,
    "startSurahNumber": 6,
    "startAyahNumber": 111,
    "startAyahText": "۞ وَلَوْ أَنَّنَا نَزَّلْنَآ إِلَيْهِمُ ٱلْمَلَٰٓئِكَةَ وَكَلَّمَهُمُ ٱلْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَىْءٍۢ قُبُلًۭا مَّا كَانُوا۟ لِيُؤْمِنُوٓا۟ إِلَّآ أَن يَشَآءَ ٱللَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ",
    "endSurahNumber": 6,
    "endAyahNumber": 165
  },
  {
    "hizb": 16,
    "startSurahNumber": 7,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓمٓصٓ",
    "endSurahNumber": 7,
    "endAyahNumber": 87
  },
  {
    "hizb": 17,
    "startSurahNumber": 7,
    "startAyahNumber": 88,
    "startAyahText": "۞ قَالَ ٱلْمَلَأُ ٱلَّذِينَ ٱسْتَكْبَرُوا۟ مِن قَوْمِهِۦ لَنُخْرِجَنَّكَ يَٰشُعَيْبُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَكَ مِن قَرْيَتِنَآ أَوْ لَتَعُودُنَّ فِى مِلَّتِنَا ۚ قَالَ أَوَلَوْ كُنَّا كَٰرِهِينَ",
    "endSurahNumber": 7,
    "endAyahNumber": 170
  },
  {
    "hizb": 18,
    "startSurahNumber": 7,
    "startAyahNumber": 171,
    "startAyahText": "۞ وَإِذْ نَتَقْنَا ٱلْجَبَلَ فَوْقَهُمْ كَأَنَّهُۥ ظُلَّةٌۭ وَظَنُّوٓا۟ أَنَّهُۥ وَاقِعٌۢ بِهِمْ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍۢ وَٱذْكُرُوا۟ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
    "endSurahNumber": 8,
    "endAyahNumber": 40
  },
  {
    "hizb": 19,
    "startSurahNumber": 8,
    "startAyahNumber": 41,
    "startAyahText": "۞ وَٱعْلَمُوٓا۟ أَنَّمَا غَنِمْتُم مِّن شَىْءٍۢ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَٱبْنِ ٱلسَّبِيلِ إِن كُنتُمْ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ ٱلْفُرْقَانِ يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "endSurahNumber": 9,
    "endAyahNumber": 33
  },
  {
    "hizb": 20,
    "startSurahNumber": 9,
    "startAyahNumber": 34,
    "startAyahText": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِنَّ كَثِيرًۭا مِّنَ ٱلْأَحْبَارِ وَٱلرُّهْبَانِ لَيَأْكُلُونَ أَمْوَٰلَ ٱلنَّاسِ بِٱلْبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ ۗ وَٱلَّذِينَ يَكْنِزُونَ ٱلذَّهَبَ وَٱلْفِضَّةَ وَلَا يُنفِقُونَهَا فِى سَبِيلِ ٱللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍۢ",
    "endSurahNumber": 9,
    "endAyahNumber": 92
  },
  {
    "hizb": 21,
    "startSurahNumber": 9,
    "startAyahNumber": 93,
    "startAyahText": "۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسْتَـْٔذِنُونَكَ وَهُمْ أَغْنِيَآءُ ۚ رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ ٱلْخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ",
    "endSurahNumber": 10,
    "endAyahNumber": 25
  },
  {
    "hizb": 22,
    "startSurahNumber": 10,
    "startAyahNumber": 26,
    "startAyahText": "۞ لِّلَّذِينَ أَحْسَنُوا۟ ٱلْحُسْنَىٰ وَزِيَادَةٌۭ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌۭ وَلَا ذِلَّةٌ ۚ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "endSurahNumber": 11,
    "endAyahNumber": 5
  },
  {
    "hizb": 23,
    "startSurahNumber": 11,
    "startAyahNumber": 6,
    "startAyahText": "۞ وَمَا مِن دَآبَّةٍۢ فِى ٱلْأَرْضِ إِلَّا عَلَى ٱللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلٌّۭ فِى كِتَٰبٍۢ مُّبِينٍۢ",
    "endSurahNumber": 11,
    "endAyahNumber": 83
  },
  {
    "hizb": 24,
    "startSurahNumber": 11,
    "startAyahNumber": 84,
    "startAyahText": "۞ وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًۭا ۚ قَالَ يَٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُۥ ۖ وَلَا تَنقُصُوا۟ ٱلْمِكْيَالَ وَٱلْمِيزَانَ ۚ إِنِّىٓ أَرَىٰكُم بِخَيْرٍۢ وَإِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍۢ مُّحِيطٍۢ",
    "endSurahNumber": 12,
    "endAyahNumber": 52
  },
  {
    "hizb": 25,
    "startSurahNumber": 12,
    "startAyahNumber": 53,
    "startAyahText": "۞ وَمَآ أُبَرِّئُ نَفْسِىٓ ۚ إِنَّ ٱلنَّفْسَ لَأَمَّارَةٌۢ بِٱلسُّوٓءِ إِلَّا مَا رَحِمَ رَبِّىٓ ۚ إِنَّ رَبِّى غَفُورٌۭ رَّحِيمٌۭ",
    "endSurahNumber": 13,
    "endAyahNumber": 18
  },
  {
    "hizb": 26,
    "startSurahNumber": 13,
    "startAyahNumber": 19,
    "startAyahText": "۞ أَفَمَن يَعْلَمُ أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ ٱلْحَقُّ كَمَنْ هُوَ أَعْمَىٰٓ ۚ إِنَّمَا يَتَذَكَّرُ أُو۟لُوا۟ ٱلْأَلْبَٰبِ",
    "endSurahNumber": 14,
    "endAyahNumber": 52
  },
  {
    "hizb": 27,
    "startSurahNumber": 15,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓر ۚ تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ وَقُرْءَانٍۢ مُّبِينٍۢ",
    "endSurahNumber": 16,
    "endAyahNumber": 50
  },
  {
    "hizb": 28,
    "startSurahNumber": 16,
    "startAyahNumber": 51,
    "startAyahText": "۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓا۟ إِلَٰهَيْنِ ٱثْنَيْنِ ۖ إِنَّمَا هُوَ إِلَٰهٌۭ وَٰحِدٌۭ ۖ فَإِيَّٰىَ فَٱرْهَبُونِ",
    "endSurahNumber": 16,
    "endAyahNumber": 128
  },
  {
    "hizb": 29,
    "startSurahNumber": 17,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ سُبْحَٰنَ ٱلَّذِىٓ أَسْرَىٰ بِعَبْدِهِۦ لَيْلًۭا مِّنَ ٱلْمَسْجِدِ ٱلْحَرَامِ إِلَى ٱلْمَسْجِدِ ٱلْأَقْصَا ٱلَّذِى بَٰرَكْنَا حَوْلَهُۥ لِنُرِيَهُۥ مِنْ ءَايَٰتِنَآ ۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
    "endSurahNumber": 17,
    "endAyahNumber": 98
  },
  {
    "hizb": 30,
    "startSurahNumber": 17,
    "startAyahNumber": 99,
    "startAyahText": "۞ أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ قَادِرٌ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلًۭا لَّا رَيْبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورًۭا",
    "endSurahNumber": 18,
    "endAyahNumber": 74
  },
  {
    "hizb": 31,
    "startSurahNumber": 18,
    "startAyahNumber": 75,
    "startAyahText": "۞ قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًۭا",
    "endSurahNumber": 19,
    "endAyahNumber": 98
  },
  {
    "hizb": 32,
    "startSurahNumber": 20,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ طه",
    "endSurahNumber": 20,
    "endAyahNumber": 135
  },
  {
    "hizb": 33,
    "startSurahNumber": 21,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِى غَفْلَةٍۢ مُّعْرِضُونَ",
    "endSurahNumber": 21,
    "endAyahNumber": 112
  },
  {
    "hizb": 34,
    "startSurahNumber": 22,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ ٱلسَّاعَةِ شَىْءٌ عَظِيمٌۭ",
    "endSurahNumber": 22,
    "endAyahNumber": 78
  },
  {
    "hizb": 35,
    "startSurahNumber": 23,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ",
    "endSurahNumber": 24,
    "endAyahNumber": 20
  },
  {
    "hizb": 36,
    "startSurahNumber": 24,
    "startAyahNumber": 21,
    "startAyahText": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ ۚ وَمَن يَتَّبِعْ خُطُوَٰتِ ٱلشَّيْطَٰنِ فَإِنَّهُۥ يَأْمُرُ بِٱلْفَحْشَآءِ وَٱلْمُنكَرِ ۚ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ مَا زَكَىٰ مِنكُم مِّنْ أَحَدٍ أَبَدًۭا وَلَٰكِنَّ ٱللَّهَ يُزَكِّى مَن يَشَآءُ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌۭ",
    "endSurahNumber": 25,
    "endAyahNumber": 20
  },
  {
    "hizb": 37,
    "startSurahNumber": 25,
    "startAyahNumber": 21,
    "startAyahText": "۞ وَقَالَ ٱلَّذِينَ لَا يَرْجُونَ لِقَآءَنَا لَوْلَآ أُنزِلَ عَلَيْنَا ٱلْمَلَٰٓئِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ ٱسْتَكْبَرُوا۟ فِىٓ أَنفُسِهِمْ وَعَتَوْ عُتُوًّۭا كَبِيرًۭا",
    "endSurahNumber": 26,
    "endAyahNumber": 110
  },
  {
    "hizb": 38,
    "startSurahNumber": 26,
    "startAyahNumber": 111,
    "startAyahText": "۞ قَالُوٓا۟ أَنُؤْمِنُ لَكَ وَٱتَّبَعَكَ ٱلْأَرْذَلُونَ",
    "endSurahNumber": 27,
    "endAyahNumber": 55
  },
  {
    "hizb": 39,
    "startSurahNumber": 27,
    "startAyahNumber": 56,
    "startAyahText": "۞ فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوٓا۟ أَخْرِجُوٓا۟ ءَالَ لُوطٍۢ مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌۭ يَتَطَهَّرُونَ",
    "endSurahNumber": 28,
    "endAyahNumber": 50
  },
  {
    "hizb": 40,
    "startSurahNumber": 28,
    "startAyahNumber": 51,
    "startAyahText": "۞ وَلَقَدْ وَصَّلْنَا لَهُمُ ٱلْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "endSurahNumber": 29,
    "endAyahNumber": 45
  },
  {
    "hizb": 41,
    "startSurahNumber": 29,
    "startAyahNumber": 46,
    "startAyahText": "۞ وَلَا تُجَٰدِلُوٓا۟ أَهْلَ ٱلْكِتَٰبِ إِلَّا بِٱلَّتِى هِىَ أَحْسَنُ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ ۖ وَقُولُوٓا۟ ءَامَنَّا بِٱلَّذِىٓ أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَٰحِدٌۭ وَنَحْنُ لَهُۥ مُسْلِمُونَ",
    "endSurahNumber": 31,
    "endAyahNumber": 21
  },
  {
    "hizb": 42,
    "startSurahNumber": 31,
    "startAyahNumber": 22,
    "startAyahText": "۞ وَمَن يُسْلِمْ وَجْهَهُۥٓ إِلَى ٱللَّهِ وَهُوَ مُحْسِنٌۭ فَقَدِ ٱسْتَمْسَكَ بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ ۗ وَإِلَى ٱللَّهِ عَٰقِبَةُ ٱلْأُمُورِ",
    "endSurahNumber": 33,
    "endAyahNumber": 30
  },
  {
    "hizb": 43,
    "startSurahNumber": 33,
    "startAyahNumber": 31,
    "startAyahText": "۞ وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعْمَلْ صَٰلِحًۭا نُّؤْتِهَآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًۭا كَرِيمًۭا",
    "endSurahNumber": 34,
    "endAyahNumber": 23
  },
  {
    "hizb": 44,
    "startSurahNumber": 34,
    "startAyahNumber": 24,
    "startAyahText": "۞ قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ قُلِ ٱللَّهُ ۖ وَإِنَّآ أَوْ إِيَّاكُمْ لَعَلَىٰ هُدًى أَوْ فِى ضَلَٰلٍۢ مُّبِينٍۢ",
    "endSurahNumber": 36,
    "endAyahNumber": 27
  },
  {
    "hizb": 45,
    "startSurahNumber": 36,
    "startAyahNumber": 28,
    "startAyahText": "۞ وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٍۢ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ",
    "endSurahNumber": 37,
    "endAyahNumber": 144
  },
  {
    "hizb": 46,
    "startSurahNumber": 37,
    "startAyahNumber": 145,
    "startAyahText": "۞ فَنَبَذْنَٰهُ بِٱلْعَرَآءِ وَهُوَ سَقِيمٌۭ",
    "endSurahNumber": 39,
    "endAyahNumber": 31
  },
  {
    "hizb": 47,
    "startSurahNumber": 39,
    "startAyahNumber": 32,
    "startAyahText": "۞ فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى ٱللَّهِ وَكَذَّبَ بِٱلصِّدْقِ إِذْ جَآءَهُۥٓ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًۭى لِّلْكَٰفِرِينَ",
    "endSurahNumber": 40,
    "endAyahNumber": 40
  },
  {
    "hizb": 48,
    "startSurahNumber": 40,
    "startAyahNumber": 41,
    "startAyahText": "۞ وَيَٰقَوْمِ مَا لِىٓ أَدْعُوكُمْ إِلَى ٱلنَّجَوٰةِ وَتَدْعُونَنِىٓ إِلَى ٱلنَّارِ",
    "endSurahNumber": 41,
    "endAyahNumber": 46
  },
  {
    "hizb": 49,
    "startSurahNumber": 41,
    "startAyahNumber": 47,
    "startAyahText": "۞ إِلَيْهِ يُرَدُّ عِلْمُ ٱلسَّاعَةِ ۚ وَمَا تَخْرُجُ مِن ثَمَرَٰتٍۢ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَآءِى قَالُوٓا۟ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٍۢ",
    "endSurahNumber": 43,
    "endAyahNumber": 23
  },
  {
    "hizb": 50,
    "startSurahNumber": 43,
    "startAyahNumber": 24,
    "startAyahText": "۞ قَٰلَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ مِمَّا وَجَدتُّمْ عَلَيْهِ ءَابَآءَكُمْ ۖ قَالُوٓا۟ إِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كَٰفِرُونَ",
    "endSurahNumber": 45,
    "endAyahNumber": 37
  },
  {
    "hizb": 51,
    "startSurahNumber": 46,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ حمٓ",
    "endSurahNumber": 48,
    "endAyahNumber": 17
  },
  {
    "hizb": 52,
    "startSurahNumber": 48,
    "startAyahNumber": 18,
    "startAyahText": "۞ لَّقَدْ رَضِىَ ٱللَّهُ عَنِ ٱلْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِى قُلُوبِهِمْ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيْهِمْ وَأَثَٰبَهُمْ فَتْحًۭا قَرِيبًۭا",
    "endSurahNumber": 51,
    "endAyahNumber": 30
  },
  {
    "hizb": 53,
    "startSurahNumber": 51,
    "startAyahNumber": 31,
    "startAyahText": "۞ قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ",
    "endSurahNumber": 54,
    "endAyahNumber": 55
  },
  {
    "hizb": 54,
    "startSurahNumber": 55,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلرَّحْمَٰنُ",
    "endSurahNumber": 57,
    "endAyahNumber": 29
  },
  {
    "hizb": 55,
    "startSurahNumber": 58,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ قَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّتِى تُجَٰدِلُكَ فِى زَوْجِهَا وَتَشْتَكِىٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسْمَعُ تَحَاوُرَكُمَآ ۚ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌ",
    "endSurahNumber": 61,
    "endAyahNumber": 14
  },
  {
    "hizb": 56,
    "startSurahNumber": 62,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ٱلْمَلِكِ ٱلْقُدُّوسِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
    "endSurahNumber": 66,
    "endAyahNumber": 12
  },
  {
    "hizb": 57,
    "startSurahNumber": 67,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ تَبَٰرَكَ ٱلَّذِى بِيَدِهِ ٱلْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "endSurahNumber": 71,
    "endAyahNumber": 28
  },
  {
    "hizb": 58,
    "startSurahNumber": 72,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ قُلْ أُوحِىَ إِلَىَّ أَنَّهُ ٱسْتَمَعَ نَفَرٌۭ مِّنَ ٱلْجِنِّ فَقَالُوٓا۟ إِنَّا سَمِعْنَا قُرْءَانًا عَجَبًۭا",
    "endSurahNumber": 77,
    "endAyahNumber": 50
  },
  {
    "hizb": 59,
    "startSurahNumber": 78,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ عَمَّ يَتَسَآءَلُونَ",
    "endSurahNumber": 86,
    "endAyahNumber": 17
  },
  {
    "hizb": 60,
    "startSurahNumber": 87,
    "startAyahNumber": 1,
    "startAyahText": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ سَبِّحِ ٱسْمَ رَبِّكَ ٱلْأَعْلَى",
    "endSurahNumber": 114,
    "endAyahNumber": 6
  }
];

export default hizbs;